Revit 2027 API
AreaLoad.Create(Document, ElementId, IList<CurveLoop>, IList<XYZ>, IList<Int32>, IList<Int32>, AreaLoadType) Method
 Creates a new custom area load within the project.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static AreaLoad Create(
	Document document,
	ElementId hostElemId,
	IList<CurveLoop> loops,
	IList<XYZ> forceVectors,
	IList<int> refPointCurveIndexes,
	IList<int> refPointCurveEnds,
	AreaLoadType symbol
)
Public Shared Function Create (
	document As Document,
	hostElemId As ElementId,
	loops As IList(Of CurveLoop),
	forceVectors As IList(Of XYZ),
	refPointCurveIndexes As IList(Of Integer),
	refPointCurveEnds As IList(Of Integer),
	symbol As AreaLoadType
) As AreaLoad
public:
static AreaLoad^ Create(
	Document^ document,
	ElementId^ hostElemId,
	IList<CurveLoop^>^ loops,
	IList<XYZ^>^ forceVectors,
	IList<int>^ refPointCurveIndexes,
	IList<int>^ refPointCurveEnds,
	AreaLoadType^ symbol
)
static member Create :
        document : Document *
        hostElemId : ElementId *
        loops : IList<CurveLoop> *
        forceVectors : IList<XYZ> *
        refPointCurveIndexes : IList<int> *
        refPointCurveEnds : IList<int> *
        symbol : AreaLoadType -> AreaLoad
Parameters
document Document
 Document to which new area load will be added.
hostElemId ElementId
 The analytical surface host element id for the area Load.
loops IList<CurveLoop>
 The loops that define geometry of the area load. The curve loop collection should contains a closed loops consisting of lines.
forceVectors IList<XYZ>
 The array of force vectors applied to the maximum three reference point of the area load.
refPointCurveIndexes IList<Int32>
 The array of maximum three curve indexes on which reference points should be placed on.
refPointCurveEnds IList<Int32>
 The array of maximum three curve ends indicating where reference points should be placed on. The array can have only 0 or 1 values, which means 0 - curve start point, 1 - curve end point.
symbol AreaLoadType
 The symbol of the AreaLoad. Set null to use default type.
Return Value
AreaLoad
 If successful, returns an object of the newly created AreaLoad. null is returned if the operation fails.
Exceptions
Exception | Condition
ArgumentException |  hostElemId is not permitted for this type of load. -or- One of the following requirements is not satisfied : - curve loops loops are not planar - curve loops loops are self-intersecting - curve loops loops contains zero length curves -or- Thrown when force vector is equal zero. -or- hostElemId is not a valid host for area load.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  Thrown if type could not be set for newly created area load.
See Also
Reference
AreaLoad Class
Create Overload
Autodesk.Revit.DB.Structure Namespace